[
  {
    "id": "93912843",
    "user": "Deanna Nunn",
    "user_id": "1148662",
    "phone_number": "9855131352",
    "call_length": "984",
    "call_date": "2025-06-19 12:46:49",
    "recording_id": "7975383",
    "filename": "103995_1148662_9855131352_2865541_241_1750362410_1257-in-1750362410.mp3",
    "call_type": "INBOUND",
    "src": "https://admin-dt.convoso.com/play-recording-public/JTdCJTIyYWNjb3VudF9pZCUyMiUzQTEwMzk5NSUyQyUyMnVfaWQlMjIlM0ElMjIyOXh0aTcyb20zbmR5ZWpiYTE1MDAyajczYjA5bHVyZCUyMiU3RA==?rlt=2C9Cxai5ZawBi403d43zslU6q8gp/P8W4Q3Rt5ZNX5A",
    "input_file": "input/93912843_0.mp3",
    "transcript_file": "transcripts/93912843_0.txt",
    "transcript": " Hey, I'm responding to an application of a submitted for health insurance. Hi, this is pre-qualifier number 8, 5, 4, 7, 1. I have Vincent on the line, so they're located in the wonderful state of Louisiana. And we just finished the pre-qualification questions. They're interested in learning what life insurance options might be available to them. They understand as well. This is not guaranteed. That's your review there info to see what they might qualify for. So Vincent, I've got licenseeation here with us now. They're fully licensed in your state and will walk you through everything from there. So I'll go ahead and step off the line. And thanks again for your time. Have a good day. Hey Vincent, how are you? Good. That's good. So my name is Diana and I'll be the person that's helping you move forward. So I'm from mutual of integrity life insurance and we represent the abated final expense carriers in the state of Louisiana. So mainly I just specialize in assisting individuals and their family to help find a life insurance plan that's most suitable for them. Oh, right. So Mr. Vincent, is this life insurance plan going to be for you or somebody else? Yes for me. Okay. Do you currently have life insurance? No, ma'am, I don't. Okay. Oh, ready? Well, I'm really glad that we're talking today. Have you ever had coverage in the past at some point? Yes, ma'am. I have. I was covered with it. Okay. What happened? When did you lose your coverage? I don't know about a about a year ago. I was too well. I don't know what really happened. Okay. All right. Well, I can see what we're talking today. You know, Vincent, many people, they kind of push this off until it becomes too late. And I see that you're not one of these people. So I'm going to do everything that I can to get you qualified today for the special state approved plan. Okay. All right. So, so Vincent, I work specifically in the final expense department. So this means that I'm the decision maker. And we'll help determine whether or not you qualify for the plans available to you here in Louisiana. Now, we definitely want you to find a plan that will fit both your needs and your budget, especially during this time. And I can tell you, if you don't want to keep putting this off because sometimes things just happen unexpectedly. Right. So in a minute, I'll have just a few basic health questions that will help give us exactly what we need to determine just to see what plans that you may qualify for. So even if you've been turned down before, this will be a way that I can give you the exact cost right now over the phone. So let's see here. I'm going to ask you those health questions and then compare your answers with all of our top companies. That way we will make sure that you get the very best plan that your health will allow. So basically, I'm going to do the shopping for you. But don't worry. I'm going to make sure that we find you something that meets both your needs and most importantly fit into your budget. So after today, you will never have to worry about this again. All right. Now, mention it because this is a special state required plan or regulated plan. No physical exam is needed. But like I said, there is a few basic health questions just to see if you'll qualify. And it's very important to answer each question completely and thoroughly because we do check with the medical information bureau, which is an insurance database that records any health questions that you've answered if you've applied for insurance at some point in the past. So as long as your answer is matched with the information we get from the MIB, we're good to go. All right, let's see here. So let me go ahead and ask these questions for you. Before we get into the health questions, let me ask the youth insulin, have nitro or Indian hairlers, even if you don't use them for like COPD and infosima. Okay. All right. Do you take any other prescription medications? I'm sorry. I didn't hear you. Yes, ma'am. I'll take. I've got to go. Okay. All right. Let's see here. So are you currently hospitalized? Confined to a bed wheelchair, living in a nursing facility or receiving hospitals home here? Hello? No, ma'am, I'm not. Okay. All right. Do you require assistance from anyone? No, ma'am, I'm not. I'm not from the nursing facility. Okay. All right. Do you require assistance from anyone with activities that they were living, such as bathing, dressing, eating, or using the toilet? No, I don't need the medicine. Okay. Have you ever been medically advised to have an organ transplant or kidney dialysis or have you been medically diagnosed that have congestive heart failure, liver failure, respiratory or bent diagnosed biomedical professional within illness that will result in death in the next 12 months? No, ma'am, none of that. Okay. All right. Let's see here. Have you ever been diagnosed with Alzheimer's, dementia, mental incapacity, ALS, AIDS, HIV, or any other terminal disease? No, ma'am. Okay. All righty. Let's see here. Have you ever been medically diagnosed or treated for complications of diabetes, including insulin shock, diabetic coma, retinopathy, neuropathy, nephropathy, or use insulin prior to AIDS? No, ma'am, none of that. Okay. Perfect. All righty. Have you ever been diagnosed, treated, or taken medication for renal insufficiency, kidney failure, chronic kidney disease, or more than one occurrence of cancer in your lifetime? No, ma'am. Okay. All righty. Let's see here. And within the past two years, have you had any diagnostic testing, including tests related to HIV, surgery, or hospitalization, advised by a medical professional, which has not been completed, or for which the results have not been received? No. Okay. Have you been medically diagnosed or taking medications for any form of cancer treated for any form of cancer? No, ma'am. I have been medically diagnosed with chronic cancer, and I know it is testing stroke or TIA, cardiomyopathy, systemic lupus, cirrhosis, hepatitis C, chronic hepatitis, chronic pancreatitis, chronic obstructive, sorry, chronic obstructive pulmonary disease, which is COPD, infosimic chronic chronic chronic chronic chronic chronicitis, I required oxygen equipment, just in breathing. No, ma'am. I'm okay. Perfect. All righty. Let's see here. Have you had a heart attack or an aneurysm, or had been medically advised to have any type of heart, brain, or circulatory surgery, including, but not limited to a pacemaker insertion, or a stipulator placement, or any procedure to improve circulation? No, ma'am. I'm learning. Okay. Have you used illegal drugs, abused alcohol or drugs, or have been recommended by a medical professional to have treatment or counseling for alcohol or drug use, or been advised to do this continue to use the drugs or alcohol? I have, for the alcohol. Okay. But I just use a go to, like, or AA thing. Okay. And it's been a couple years since you've had that? Well, it's been this, well, I just got a fast food for, I took for the seizure. Okay. All righty. Okay. All righty. Well, in the past two years, I mean, three years have you been medically diagnosed or treated, or hospitalized, or a stroke, just pain, heart attack, aneurysm, heart, or circulatory surgery, or any procedure to improve the circulation? No, ma'am. Okay. Within the past three years, have you been medically diagnosed or treated or hospitalized for paralysis of two or more extremities? It's a rebaral palsy, sorry, cerebral palsy, multiple sclerosis, seizures, Parkinson's disease, or muscular dystrophy. You said that you just went in for a seizure, correct? Yeah. Yeah, to see you. Yeah. All righty. Okay, let's see here. And within the past six months, have you been hospitalized or diagnosed by medical professional with all the medical complications? Do you choose the mobile virus, which is COVID-19, or have you currently diagnosed by medical professional or been treated for COVID-19? I have been treated, but that's, I like, 2000. Okay, it wasn't, it wasn't, it wasn't within the past six months. No, ma'am. Okay. All righty, let's see here. Now visit Vincent. Actually come to make sure that we have this correct for you. So the only thing that we're really worried about is like you had seizures, and that was what, a month or two ago you said? No, last week. Last week and you had a seizure. Okay. All righty. Okay, so here's the thing. These state regulated financial, financial, final expense plans are income and age base, and the carriers only allow a certain number of people per month for age group to lock into the lowest lifetime rates. Once these spots fill up, the plans can close out or the pricing tiers change, and I've been working on that. And that's going to happen overnight. And I'm going to go ahead and place you on a brief hold for a few moments. I submit all of this just to see which carriers are in rolling. Okay. Okay. All righty. Okay, bear with me just a few moments. Okay. Okay. Okay. So let me see here really fast. So what is your height and your weight? Mr. Vendon. Okay. Okay. Okay. I'm about five nine. Okay. I'm about five nine. It's about one ninety. Okay. I think it's your verify for me your data birth. Three twelve sixty one. All righty. Perfect. Okay. I just wanted to make sure that I had that for you as well. Let's see here. Oh, Brady. Now if we are able to find a policy that is going to work for you, do you know what kind of price range you were trying to stay in? No, I didn't think about that. Okay. So what's seventy five be too much for you a month? No, wow. That'll be pretty good. Okay. All righty. Awesome. I'm just going to go ahead and make a little note of that for you. Okay. Let's see here. Okay. Already perfect. So bear with me just a few more moments. Okay. Okay. Data birth is missing. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. You know what, I'm gonna make that quick. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Good. Okay. Okay. you you you you Yes ma'am. Already perfect. So I do have Kaitlyn here and Kaitlyn specializes in all of the association plans that are specific for the area that you're in. So Kaitlyn, can you hear me? Yes, I can. Alrighty. So Mr. Vincent, Kaitlyn is absolutely fantastic at what she does and she's going to be able to better assist from here, okay? Okay. All right. First of all, we are just going to be forward to a life insurance policy.",
    "summary": " Hey, I'm responding to an application of a submitted for health insurance. Hi, this is pre-qualifier number 8, 5, 4, 7, 1. I have Vincent on the line, so they're located in the wonderful state of Louisiana. And we just finished the pre-qualification questions. They're interested in learning what life insurance options might be available to them. They understand as well. This is not guaranteed. That's your review there info to see what they might qualify for. So Vincent, I've got licenseeation h-4-8-6. I see that you're a male. You are 47 years old. I see that you're a smoker. I see that you're in good health. I also see that you're interested in a final expense policy. And I've also got a spouse on this application. She is a female. She's 47 years old. She's also a smoker. She's also in good health. I see that you both currently have no life insurance in place. Your income is $1,700 per month or $20,400 per year. I see that you are retired. You're also collecting Social Security,"
  },
  {
    "id": "93912843",
    "user": "Deanna Nunn",
    "user_id": "1148662",
    "phone_number": "9855131352",
    "call_length": "984",
    "call_date": "2025-06-19 12:46:49",
    "recording_id": "7975579",
    "filename": "103995_1148662_9855131352_2865541_3877_1750363393_5692-in-1750363393.mp3",
    "call_type": "INBOUND",
    "src": "https://admin-dt.convoso.com/play-recording-public/JTdCJTIyYWNjb3VudF9pZCUyMiUzQTEwMzk5NSUyQyUyMnVfaWQlMjIlM0ElMjI1aXc4bzA4dXN3dHpvYmY1YWE5Y2Ntb3RjY2pkdnYzciUyMiU3RA==?rlt=2C9Cxai5ZawBi403d43zslU6q8gp/P8W4Q3Rt5ZNX5A",
    "input_file": "input/93912843_1.mp3",
    "transcript_file": "transcripts/93912843_1.txt",
    "transcript": " Correct. Man. We're searching for just a life insurance plan. Yeah. Okay. And we're trying to stay around the budget of around $75 a month. Do you know what type of coverage you're looking to receive? Yes, what a health, I guess. Yes, what type of space and not like what type of budget you're looking to receive? What type of coverage you're looking to receive? I know you're trying to stay around $75. It don't really have to stay on 75. But you know, some way around in that range. But just for my health and everything, I'm 65, I'm 65, I'm 60, four years old. And I don't really have no conditions for lack of a tool. I had a teacher last week. All right. Okay, we'll do bear with me. Give me just one moment. I'll go ahead and pull up that quote for you and we'll discuss the benefits are available for you. Then okay. Okay. The thing I'm going to help. Okay. Okay. Okay. All right. Okay. All right, Vincent. Okay, so I do see here you are 64. Can you please verify your date of birth for me? 312-61. Thank you. Okay, so it's voting up now. Now, one second, sir. Okay. I'm going to go ahead and do a vote. Okay, so I do have your vote up for you here now. I was able to get you approved for a state regular financial plan with life insurance through American appables. They have been helping you off with low cost. They approved plans for over 100 years. You're monthly rate. You'd be looking at would be $75 a month. And the benefit value of the 13,300 and $5. This rate is locked in for a lifetime of the plan. They will never increase. Now, is that something affordable for you before I submit the plan to the underwriter for approval? I'm sorry. I didn't hear you. Yes, is that something that's manageable for you before I submit the plan? Yes, ma'am. Yes, ma'am. That's sound perfect. It's really good coverage for your age and area and all the carriers. So I do want to verify your health conditions. I know you said that you had only a teacher correct. Yes, ma'am. Okay, and that was my head. Yeah. Okay. Do you take any medications for that with anything prescribed? Yeah, they did. I didn't know. I didn't go to the doctor yet to get them. I don't see it too little. What you're going to call them to get them. Yes. I don't know. When I sent them with real, you'd help them deal with all of that. So you need that home right now. So I would, I would have to find out from him. But I had also had a hit replacement. I've got to use it. Yes, just, yes, been over 10 years. Well, I did 10 something like that. I don't know where you. And can you please verify your mailing address for me? 32, 42, highway one Napoleon field. 7039, zip code. And any apartment or unit number? No, 32, 42, highway one Napoleon. That's a house number. That's my house. I live in a house. Okay, and can probably have your social security number. So it's a security number. Yes, sir. Wow. I use a social security number in the long time. Let me see about the social code. Looks like something. Take your time. This board 36151485. Thank you. Thank you. Thank you. Can I have your email address here? Yes. Your email address. I don't know what this means. I never use it. My son or my wife, my ex-wife. This is my email address. And were you born in the state of Louisiana? Yes, now. New Orleans, Louisiana. Can I get your proctimate height and weight? About five, eight, maybe one, 50. Would you like to set up as the beneficiary for your policy? Who would you make with doctor? No beneficiary. This is who would receive that face amount in the case of your passing. Oh, Lord. Be a friend family member. Zenfinger. Zenfinger, junior. Zenfinger, junior. Okay. Can I put more than one on it? You can. Because I do have a sister, my daughter too. Okay. And what's the mention state of parents? Okay. Let me see. January 7th. And the year? I got a rule down on the paper outside. I got a good team. Okay. I don't got a rule out of life. I don't think January 7th. I don't know. I don't know. I don't know. In 1992. Okay. Okay. All right. All right. Here is the date, and now we are reserving your rate out. We would be setting up directly with the check of the bank. What bank do you think was? Oh. Capital one. Capital one. And whenever you have that handy, you want to start off with the routing number for me first. The routing number? Yes, sir. No, it's just the same address I have a mail box. No, the routing number to your account for your checking and routing for your bank. Oh, Lord, I never use that account. I would have to get with my son with that. Yes. Yeah, I would have to get with him with that. You don't have access to like your checks or your online banking to pull that up. No, I don't even use the account in the board. Okay. And is your son currently available with you to help you to put that up? No, man. No, he's not here. He had worked. Sorry about that. Yes, so we would have to put the account number on file, even for the ray out. And actually, did you walk in at this rate? Do you get like a check each month? Yeah, but he goes to a little as well. I get a disability check and it comes on a direct call. I don't get no. So that car may have an account connected to it. We're going in the same way. Thank you, son. Thank you. Thank you. Thank you. Thank you. Yes, ma'am. I see the number on you. Okay. Thank you. Thank you. Five, three, three, two, four, eight, zero, zero. Five, nine, nine, zero. Zero, four, nine, zero. Okay. And is there another number on there that says routing? No, that's not only the last year. Okay. What bank? Bank. This is the positive two. That direct express. No, this is all. Let me let this thing go. Okay. Okay. Okay. Okay. Okay. It's C O M C R N I C A. Okay. Now the number you gave me, are you reading that off a card or a statement? No, he's off my card. Okay. Do you have a sheet of paper that is like a billing statement? That they can't record. No, I should you. Why? I should show you like your billing statements that would have like your kind of. They just send it. They send it. They put the money straight on the court. All I do is go to capital one and use it. Okay. No worries. They got direct express code. So did they send you a paper in the mail every month that shows you your transaction that you use that card for? Mail. Do they send you a paper in the mail that they show you your transactions for the month? No mail. They put money on a card and I take it off. I don't deal with deal that I don't get nothing from them but let them. And it's been going on for about three or four years now. No worries. You have me one moment. Okay. You have me one moment. You have me one moment. I do not have her. I am just filling out the application for you, okay? Okay. I am just filling out the application for you, okay? Okay. you you you you school We will also check in with you every so often to see how you are doing in the meantime. If you ever have any questions, do feel free to give me a call. I am going to provide you up with a case manager. D.B.I.Chend, you have like a pen and paper handy to take down her contact information. Okay. Okay. Perfect. Her name is going to be Tiffany Holmes. These are supervising you, manager assigned to your account. It's T.I.S.F.F.A.N.Y. And then Holmes. Yes, yes. Yes, F.F.A.N.Y. And then Holmes is H-O-L in the E.S. You can reach her anytime Monday through Friday, Central time, 9 a.m. to 6 p.m. So number is going to be 800, 3, 3, 3, sorry, 8, 3, 3, 8, 9, 4, 2, 2, 7, 3. Okay. Okay. Now lastly, your life insurance plan, again, it is directly through American applicable. Your monthly payment is going to be $75 even. They will send you your welcome documents for your new life insurance plan. So please continue to be honest and truthful about your medical history. And once you are fully approved, your monthly rates will be locked in. And your life insurance plan will be issued. Okay. Okay. Now also I do work mostly up for a referral basis. So once you do see the true value of benefits, if you do want to give, you know, our name and number out to two of your friends and family, I really appreciate it as well. Okay. Okay. Now I am going to get you over to the State Verification Department. Did you have any other questions for me before I do so? No, ma'am. Thank you. All right. Perfect. Well, do bear with me. I will put you on a brief hold, why transfer you over to the State Verification Department. And they'll get you over and get you up to the date then, okay? Okay. And also, sir, I do have that card. You provided out to me. Can you provide me out with that expiration date for that card? The night month is 30th, 29th. Okay. And CCB? Huh? The three-digit code on the back. Four, three, three. Perfect. Okay. So I will go ahead and get you over now to the Verification Department. So just bear with me one moment, okay? Okay. Thank you. Thank you. Thank you. Hi, Vincent. How are you doing? Good. How are you doing today? I'm doing good. That's good. My name is Anna in Verification. I'm just going to verify the information and make sure I have everything correct before continuing. So I have Vincent MacKins. That's M-I-C-K-E-N-S. Yes, ma'am. And then your date of birth. I have March 12, 1961. Yes, ma'am. Phone number 985-5131352. Okay. Okay. Yeah, that's correct. Okay. And then the email I have Richard Dene. 194 at gmail.com. And then address three, two, four, two, highway one. Napoleonville, Louisiana. 70390. Okay, great. Okay. Now I do have a life insurance here of $75 monthly. Is that correct? Yeah. Okay. Now for any questions regarding the plan or billing or any aspect of the plan moving forward, the best number to call, will be that 1-800-309. 3-386 number for Tiffany. Okay. Okay. And then for tomorrow, you will be receiving a welcome call that should only take about a minute. It's just to make sure you receive your important documents. What would be the best time to schedule that for you? Any time would be good. Okay, great. Okay. Now I do have just one e-sign here. I'm going to send you that way. You can make sure review your information. Make sure it looks correct. Sign for your plan. And then we'll be done with your enrollment. Okay, that's good. Would you prefer text or email? Text. Text. Okay. Just one moment. Text. Okay. You said text. Yes, ma'am. Now for the text, you're going to receive a code. Just when that comes in, read the code back to me to verify. Okay. You sent it. Okay. So I sent it to the 985-5131352. Okay. Anything come in? I didn't see none. Let me try refunding it. Okay. Okay. I got it. Okay. What's the code? Okay. Okay. Okay. Okay. I'm sending that now. Okay. Okay. Okay. Now do you see a text coming in with the link? Yes, ma'am. Now when you click on the link, I believe the first page will have you enter the last four of your social to log in to view the document. Okay. Okay. Okay. Okay. Okay. You send me a text. Can I get to the text and don't hang up in the hole? Okay. Okay. Okay. You need to put the last. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. I did it. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Now, you'll be receiving a confirmation email in the next 24 to 48 hours. Okay. Okay. Okay. So if you do have any question, you can reach out to Tiffany at that 1-800 number. But other than that, it was a pleasure speaking with you. I hope you have a great day. Okay. You too. Thank you. Bye.",
    "summary": " Correct. Man. We're searching for just a life insurance plan. Yeah. Okay. And we're trying to stay around the budget of around $75 a month. Do you know what type of coverage you're looking to receive? Yes, what a health, I guess. Yes, what type of space and not like what type of budget you're looking to receive? What type of coverage you're looking to receive? I know you're trying to stay around $75. It don't really have to stay on 75. But you know, some way around in that range. But just for mans life insurance, you know? Yeah. Okay. Now, what's the age of the man that you're trying to get this life insurance for? 47. Okay. And what's his nationality? His nationality is, he's from the United States. Okay. And what's his occupation? He's a truck driver. Oh, okay. And is he a smoker or a non-smoker? He's a non-smoker. Okay. And, if you don't mind answering, how tall is he and how much does he weigh? He's about five-nine and he weighs about 220 pounds. Okay. And does he,"
  }
]